-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Nov 16, 2021 at 10:25 AM
-- Server version: 5.7.33
-- PHP Version: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `science_edoc`
--

-- --------------------------------------------------------

--
-- Table structure for table `files`
--

CREATE TABLE `files` (
  `id` int(11) NOT NULL,
  `file_name` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `uploaded_on` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `memo_id` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `user_id` varchar(10) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `files`
--

INSERT INTO `files` (`id`, `file_name`, `uploaded_on`, `memo_id`, `user_id`) VALUES
(1, 'Scanขออนุญาตไปราชการวันที่15พฤศจิกายน2564.jpg', '2021-11-08 02:17:25', '1', '15'),
(2, '(ร่าง) คำสั่งคณะวิทยาศาสตร์และเทคโนโลยี เรื่อง แต่งตั้งคณะกรรมการดำเนินการสอบวัดคุณสมบัตินักศึกษาก่อนสำเร็จการศึกษา สาขาวิชาชีววิทยา.docx', '2021-11-08 02:25:43', '2', '98'),
(3, 'โครงการ  การสอบวัดคุณสมบัตินักศึกษาสาขาวิชาชีววิทยาก่อนสำเร็จการศึกษา.pdf', '2021-11-08 02:25:43', '2', '98'),
(4, '18308_เอกสารที่ปรึกษาวิจัย.pdf', '2021-11-08 02:27:11', '3', '19'),
(5, '(ร่าง) คำสั่งคณะวิทยาศาสตร์และเทคโนโลยี เรื่อง แต่งตั้งคณะกรรมการดำเนินการสอบวัดคุณสมบัตินักศึกษาก่อนสำเร็จการศึกษา สาขาวิชาชีววิทยา.pdf', '2021-11-08 02:36:50', '2', '98'),
(6, '(ร่าง) คำสั่ง.docx', '2021-11-08 02:50:45', '2', '98'),
(7, '(ร่าง) คำสั่ง.pdf', '2021-11-08 02:50:45', '2', '98'),
(11, '11.ณภัสกร-20211108T032505Z-001.zip', '2021-11-08 04:35:45', '4', '65'),
(12, '19.วรากร-20211108T031902Z-001.zip', '2021-11-08 04:35:45', '4', '65'),
(13, '22.ศิริวดี-20211108T032433Z-001.zip', '2021-11-08 04:35:45', '4', '65'),
(14, 'Scan2.PDF', '2021-11-08 04:35:45', '4', '65'),
(15, 'Scan20001.PDF', '2021-11-08 04:35:45', '4', '65'),
(16, 'Scan20002.PDF', '2021-11-08 04:35:45', '4', '65'),
(17, '', '2021-11-08 04:38:48', '5', '90'),
(18, '', '2021-11-08 05:32:37', '2', '98'),
(19, 'วิทยากร วันที่ 15.pdf', '2021-11-08 05:51:26', '6', ''),
(20, 'หนังสือเชิญวิทยากร+หนังสือขออนุญาตไปราชการ.pdf', '2021-11-08 06:48:31', '7', '72'),
(21, '', '2021-11-08 07:32:20', '6', '71'),
(22, '', '2021-11-08 07:42:15', '6', '71'),
(23, '650222090 การจัดสอบวัดคุณสมบัตินักศึกษาก่อนสำเร็จการศึกษา.pdf', '2021-11-08 08:36:24', '8', '44'),
(24, 'กำหนดการการจัดสอบวัดคุณสมบัตินักศึกษาก่อนสำเร็จการศึกษา.pdf', '2021-11-08 08:36:24', '8', '44'),
(25, '1112564_U2T อบรมอาชีพ ห้วยพิชัย.pdf', '2021-11-08 08:51:33', '9', '96'),
(26, 'ใบอนุมัติโครงการ U2T.jpg', '2021-11-08 08:51:33', '9', '96'),
(27, 'กำหนดการโครงการอบรมเชิงปฏิบัติการพัฒนาและส่งเสริมสัมมาชีพเพื่อสร้างอาชีพใหม่ในชุมชน.docx', '2021-11-08 08:51:33', '9', '96'),
(28, '', '2021-11-08 08:53:44', '9', '96'),
(29, 'หนังสือเชิญ ผศ.สุรจิตร์ ดร.มธุรส.pdf', '2021-11-08 12:54:28', '10', '80'),
(30, 'อบรมเตรียมความพร้อมก่อนออกฝึกสหกิจศึกษา.pdf', '2021-11-08 14:11:01', '11', '95'),
(31, 'แต่งตั้งกรรมการออกข้อสอบ.pdf', '2021-11-09 04:30:10', '12', '21'),
(32, '244953437_967666160629049_9205236466262471418_n.jpg', '2021-11-09 06:35:54', '13', '54'),
(33, 'กำหนดการโครงการ ปฐมนิเทศปีที่ 4.docx', '2021-11-09 07:16:21', '14', '98'),
(34, 'กำหนดการโครงการ ปฐมนิเทศปีที่ 4.pdf', '2021-11-09 07:16:21', '14', '98'),
(35, 'โครงการ ปฐมนิเทศปี 4.docx', '2021-11-09 07:16:21', '14', '98'),
(36, 'โครงการ ปฐมนิเทศปี 4.pdf', '2021-11-09 07:16:21', '14', '98'),
(37, '', '2021-11-09 07:27:32', '14', '98'),
(38, '', '2021-11-09 07:28:12', '14', '98'),
(40, 'ตารางสอนชดเชยรายวิชาการออกกำลังกายเพื่อสุขภาพ.pdf', '2021-11-09 07:44:50', '13', '54'),
(41, 'ตารางสอนอาจารย์.docx', '2021-11-09 07:46:10', '10', '80'),
(42, '', '2021-11-09 07:55:50', '13', '54'),
(43, '', '2021-11-09 07:58:43', '10', '80'),
(44, '', '2021-11-09 08:15:45', '13', '54'),
(45, '244953437_967666160629049_9205236466262471418_n.jpg', '2021-11-09 08:19:26', '15', '54'),
(49, 'เอกสารแนบไปราชการ.pdf', '2021-11-10 01:15:22', '16', '28'),
(50, '44996.jpg', '2021-11-10 04:28:11', '17', '45'),
(51, 'โครงการส่งเสริมการปลูกพืชสมุนไพรประจำถิ่นเพื่อการท่องเที่ยว.pdf', '2021-11-10 06:29:14', '18', ''),
(52, 'โครงการส่งเสริมการปลูกพืชสมุนไพรประจำถิ่นเพื่อการท่องเที่ยว.pdf', '2021-11-10 06:38:35', '19', '78'),
(53, 'โครงการส่งเสริมการปลูกพืชสมุนไพรประจำถิ่นเพื่อการท่องเที่ยว.pdf', '2021-11-10 06:43:19', '20', '78'),
(54, '', '2021-11-10 09:41:40', '18', '128'),
(55, 'โครงการส่งเสริมการปลูกพืชสมุนไพรประจำถิ่นเพื่อการท่องเที่ยว.pdf', '2021-11-10 09:45:52', '21', '128'),
(56, '', '2021-11-10 09:47:57', '21', '128'),
(57, 'โครงการ.pdf', '2021-11-10 10:37:50', '22', '64'),
(58, '', '2021-11-11 02:31:15', '23', '3'),
(62, 'กำหนดการโครงการอบรมเชิงปฏิบัติการพัฒนาและส่งเสริมสัมมาชีพเพื่อสร้างอาชีพใหม่ในชุมชน_อนุมัติ.docx', '2021-11-11 02:43:39', '24', '96'),
(63, '1112564_U2T อบรมอาชีพ ห้วยพิชัย.pdf', '2021-11-11 03:06:18', '24', '96'),
(64, 'แผนการดำเนินงานโครงการอบรมเชิงปฏิบัติการส่งเสริมสัมมาชีพ.docx', '2021-11-11 03:06:18', '24', '96'),
(65, 'ใบอนุมัติโครงการ U2T.jpg', '2021-11-11 03:06:18', '24', '96'),
(66, 'กำหนดการโครงการอบรมส่งเสริมสัมมาชีพ_อนุมัติ.docx', '2021-11-11 03:06:18', '24', '96'),
(67, '', '2021-11-11 03:27:19', '25', '64'),
(68, '1112564_U2T อบรมอาชีพ ห้วยพิชัย.pdf', '2021-11-11 04:16:58', '26', '96'),
(69, 'แผนการดำเนินงานโครงการอบรมเชิงปฏิบัติการส่งเสริมสัมมาชีพ.docx', '2021-11-11 04:16:58', '26', '96'),
(70, 'ใบอนุมัติโครงการ U2T.jpg', '2021-11-11 04:16:58', '26', '96'),
(71, 'กำหนดการโครงการอบรมส่งเสริมสัมมาชีพ_อนุมัติ.docx', '2021-11-11 04:16:58', '26', '96'),
(72, '1112564_U2T อบรมอาชีพ ห้วยพิชัย.pdf', '2021-11-11 04:21:19', '27', '96'),
(73, 'ใบอนุมัติโครงการ U2T.jpg', '2021-11-11 04:21:19', '27', '96'),
(74, 'กำหนดการโครงการอบรมส่งเสริมสัมมาชีพ_อนุมัติ.docx', '2021-11-11 04:21:19', '27', '96'),
(75, '1112564_U2T อบรมอาชีพ ห้วยพิชัย.pdf', '2021-11-11 04:31:56', '28', '96'),
(76, 'ใบอนุมัติโครงการ U2T.jpg', '2021-11-11 04:31:56', '28', '96'),
(77, 'กำหนดการโครงการอบรมส่งเสริมสัมมาชีพ_อนุมัติ.docx', '2021-11-11 04:31:56', '28', '96'),
(78, 'ใบรับรองแพทย์ กีรติ.pdf', '2021-11-11 04:40:24', '29', '30'),
(79, '', '2021-11-12 02:29:51', '30', '30'),
(80, 'กำหนดการการจัดสอบวัดคุณสมบัตินักศึกษาก่อนสำเร็จการศึกษา.pdf', '2021-11-12 02:37:17', '31', '44'),
(81, 'ตำแหน่งหน้าที่ของคณะกรรมการดำเนินงาน.pdf', '2021-11-12 03:06:59', '32', '44'),
(82, '', '2021-11-12 05:51:35', '33', '95'),
(83, '', '2021-11-15 05:59:38', '33', '7'),
(84, '', '2021-11-15 08:22:18', '34', '7'),
(85, '1112564_U2T อบรมอาชีพ ห้วยพิชัย.pdf', '2021-11-15 08:46:25', '35', '96'),
(86, 'ใบอนุมัติ U2T อบรมสัมมาชีพ_edit.jpg', '2021-11-15 08:46:25', '35', '96'),
(87, 'กำหนดการโครงการอบรมส่งเสริมสัมมาชีพ_อนุมัติ.docx', '2021-11-15 08:46:25', '35', '96'),
(88, '1112564_U2T อบรมอาชีพ ห้วยพิชัย.pdf', '2021-11-15 08:50:16', '36', '96'),
(89, 'ใบอนุมัติ U2T อบรมสัมมาชีพ_edit.jpg', '2021-11-15 08:50:16', '36', '96'),
(90, 'กำหนดการโครงการอบรมส่งเสริมสัมมาชีพ_อนุมัติ.docx', '2021-11-15 08:50:16', '36', '96'),
(92, '650022070 อบรมการเตรียมความพร้อมก่อนออกฝึกประสบการณ์วิชาชีพและปฐมนิเทศ.pdf', '2021-11-16 02:26:11', '37', '54'),
(93, 'Scanใบลาพักผ่อน.jpg', '2021-11-16 03:17:56', '38', '15'),
(94, 'บันทึกเข้าร่วมแจ้งผลการประเมินพนักงานสายสนับสนุน.jpg', '2021-11-16 03:18:00', '38', '15');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `files`
--
ALTER TABLE `files`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `files`
--
ALTER TABLE `files`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=95;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
