-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Mar 05, 2022 at 10:29 PM
-- Server version: 5.7.33
-- PHP Version: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `human_edoc`
--

-- --------------------------------------------------------

--
-- Table structure for table `files`
--

CREATE TABLE `files` (
  `id` int(11) NOT NULL,
  `file_name` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `uploaded_on` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `memo_id` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `user_id` varchar(10) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `files`
--

INSERT INTO `files` (`id`, `file_name`, `uploaded_on`, `memo_id`, `user_id`) VALUES
(1, 'ขออนุญาตใช้สถานที่.pdf', '2022-03-01 19:01:32', '0001', '15'),
(2, '(640815011) โครงการ COVID Week  pass.pdf', '2022-03-02 03:27:17', '0002', '10'),
(3, 'IMG_20210603_174816.jpg', '2022-03-02 03:27:17', '0002', '10'),
(4, 'รายชื่อนักเรียนประจำปีการศึกษา 2564 (ฝ่ายมัธ.xls', '2022-03-02 03:27:17', '0002', '10'),
(5, 'แจ้งผู้ประชุม Zoom.doc', '2022-03-02 03:27:17', '0002', '10'),
(6, 'ป้ายต้นไม้.docx', '2022-03-02 03:27:22', '0003', '6'),
(7, '', '2022-03-02 03:29:33', '0004', '8'),
(8, 'DigitalFile_341335.pdf', '2022-03-02 03:30:54', '0005', '51'),
(9, '', '2022-03-02 03:32:24', '0003', '6'),
(10, '', '2022-03-02 03:38:23', '0006', '7'),
(11, 'Maxicare Coit - Mylands and Lincrusta.pdf', '2022-03-02 03:40:20', '0002', '10'),
(12, '', '2022-03-02 03:40:34', '0007', '13'),
(13, 'ขอรับการสนับสนุนครุภัณฑ์เพื่อใช้ในห้องสมุดสาขาวิชานิติศาสตร์ศูนย์การศึกษามหาวิทยาลัย2.docx', '2022-03-02 03:43:52', '0008', '11'),
(14, '', '2022-03-02 03:44:46', '0007', '13'),
(15, '', '2022-03-02 03:47:47', '0007', '13'),
(16, '', '2022-03-02 03:48:17', '0004', '8'),
(17, '', '2022-03-02 03:50:24', '0009', '12'),
(18, '', '2022-03-02 03:56:03', '0006', '7'),
(19, '', '2022-03-02 03:58:05', '0004', '8'),
(20, '', '2022-03-02 03:58:29', '0007', '13'),
(21, '', '2022-03-02 04:03:38', '0010', '5'),
(22, '', '2022-03-02 04:04:01', '0005', '51'),
(23, '', '2022-03-02 04:05:14', '0010', '5'),
(24, '', '2022-03-02 04:06:01', '0006', '7'),
(25, '', '2022-03-02 04:09:14', '0005', '51'),
(26, '', '2022-03-02 04:09:58', '0007', '13'),
(27, '', '2022-03-02 04:12:51', '0011', '3'),
(28, '', '2022-03-02 04:15:19', '0004', '8'),
(29, '', '2022-03-02 04:17:35', '0007', '13'),
(30, '', '2022-03-02 04:31:27', '0007', '13'),
(31, '', '2022-03-02 04:40:14', '0003', '6'),
(32, '', '2022-03-02 07:38:59', '0012', '4'),
(33, '', '2022-03-02 07:39:26', '0012', '4'),
(34, '16 เป้าหมาย-resize(Color).pdf', '2022-03-02 07:57:04', '0013', '87'),
(35, 'ใบขออนุญาตใช้ยานพาหนะ.pdf', '2022-03-02 07:59:48', '0014', '31'),
(36, '', '2022-03-02 07:59:54', '0015', '50'),
(37, 'download (3).jpg', '2022-03-02 08:02:51', '0016', '55'),
(38, '', '2022-03-02 08:03:15', '0017', '30'),
(39, '', '2022-03-02 08:04:31', '0018', '19'),
(40, 'แบบเสนอโครงการพัฒนาคุณธรรมจริยธรรมสำหรับนักศึกษา สาขาภาษาอังกฤษ ปีงบประมาณ 64.docx', '2022-03-02 08:05:03', '0019', '128'),
(41, '', '2022-03-02 08:05:48', '0020', '29'),
(42, 'download.png', '2022-03-02 08:05:55', '0021', '55'),
(43, '', '2022-03-02 08:06:43', '0022', '56'),
(44, '', '2022-03-02 08:09:05', '0023', '74'),
(45, '', '2022-03-02 08:09:12', '0012', '4'),
(46, '', '2022-03-02 08:27:36', '0024', '14'),
(47, '', '2022-03-02 08:30:52', '0024', '14'),
(48, '', '2022-03-02 08:35:31', '0020', '29'),
(49, 'รหัสบทความ-227(1).pdf', '2022-03-02 08:38:26', '0014', '31'),
(50, '', '2022-03-02 08:41:02', '0019', '128'),
(51, '', '2022-03-02 08:41:44', '0022', '56'),
(52, 'ปก การเขียน ตำรา.pptx', '2022-03-02 08:55:49', '0025', '22'),
(53, '', '2022-03-02 08:59:11', '0025', '22');

-- --------------------------------------------------------

--
-- Table structure for table `files_letter`
--

CREATE TABLE `files_letter` (
  `id` int(11) NOT NULL,
  `file_name` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `uploaded_on` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `letter_id` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `user_id` varchar(10) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `files_letter`
--

INSERT INTO `files_letter` (`id`, `file_name`, `uploaded_on`, `letter_id`, `user_id`) VALUES
(1, 'Decoding-Workbook.pdf', '2022-03-01 19:03:10', '0001', '2'),
(2, 'กลุ่ม2 แผนการจัดการเรียนรู้ica3.pdf', '2022-03-02 04:19:57', '0002', '2');

-- --------------------------------------------------------

--
-- Table structure for table `letters`
--

CREATE TABLE `letters` (
  `id` int(10) NOT NULL,
  `letter_id` varchar(10) NOT NULL,
  `letter_date` varchar(100) NOT NULL,
  `letter_time` varchar(100) NOT NULL,
  `title` varchar(255) NOT NULL,
  `details` text NOT NULL,
  `name` varchar(100) NOT NULL,
  `position` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `letters`
--

INSERT INTO `letters` (`id`, `letter_id`, `letter_date`, `letter_time`, `title`, `details`, `name`, `position`) VALUES
(1, '0001', '2 มี.ค. 2565', '02:03', 'aaa', 'aaa', 'นางสาวกุสุมา อินทรา', 'ผู้ปฏิบัติงานบริหาร'),
(2, '0002', '2 มี.ค. 2565', '11:19', 'แจ้งเปลี่ยนแปลงวันที่ดำเนินโครงการ', 'ตามบันทึกข้อความที่ 07775 ลงวันที่ 25 ตุลาคม 2564 มหาวิทยาลัยราชภัฏเลยได้อนุมัติดำเนิน โครงการธนาคารขยะชุมชน สร้างความมั่นคงให้ครอบครัว พัฒนาชุมชนอย่างยั่งยืน” จำนวนงบประมาณทั้งสิ้น 88,480 บาท (แปดหมื่นแปดพันสี่ร้อยสี่สิบแปดบาทถ้วน) ไปแล้วนั้น เนื่องด้วยในวันที่ 28 พฤศจิกายน 2564 สำนักงานคณะกรรมการการเลือกตั้ง (กกต.) กำหนดให้มีการเลือกตั้งสมาชิกสภาองค์การบริหารส่วนตำบลและนายกองค์การบริหารส่วนตำบล (อบต.) จึงทำให้กลุ่มชาวบ้านและวิทยากรที่จะเข้าร่วมกิจกรรมในวันที่ 28 พฤศจิกายน 2564 นั้นไม่สามารถมาเข้าร่วมกิจกรรมได้ ดังนั้นจึงขอเปลี่ยนแปลงวันที่ดำเนินโครงการธนาคารขยะชุมชน สร้างความมั่นคงให้ครอบครัว พัฒนาชุมชนอย่างยั่งยืน เป็นวันที่ 1 ธันวาคม 2564  ดังรายละเอียดที่แนบมาพร้อมนี้', 'นางสาวกุสุมา อินทรา', 'ผู้ปฏิบัติงานบริหาร');

-- --------------------------------------------------------

--
-- Table structure for table `member`
--

CREATE TABLE `member` (
  `id` int(4) NOT NULL,
  `field` varchar(100) NOT NULL,
  `name` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `pass` varchar(100) NOT NULL,
  `line_token` varchar(255) NOT NULL,
  `dep` varchar(100) NOT NULL,
  `status` char(1) NOT NULL,
  `image` varchar(100) NOT NULL,
  `rule` varchar(4) NOT NULL,
  `pass_update` char(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `member`
--

INSERT INTO `member` (`id`, `field`, `name`, `email`, `pass`, `line_token`, `dep`, `status`, `image`, `rule`, `pass_update`) VALUES
(1, 'หัวหน้าสำนักงานคณบดี', 'นางสาวบัวบาล จุตะโน', 'bb_lru@hotmail.com ', '1cd3882394520876dc88d1472aa2a93f', 'YDnrwMGF0EkltYwLhurwpzZeaH8heypGAJI698K8T2w', 'สำนักงานคณะ', '1', 'bb_lru.jpg', '9', '1'),
(2, 'ผู้ปฏิบัติงานบริหาร', 'นางสาวกุสุมา อินทรา', 'Kusumaemouse@gmail.com', 'b59c67bf196a4758191e42f76670ceba', 'ynPmbxRSLzwGrWEFRgV4Y0rv3bWzjEXMy9xu27bvDbJ', 'สำนักงานคณะ', '1', 'Kusumaemouse.jpg', '8', '1'),
(3, 'ผู้ปฏิบัติงานบริหาร', 'นางสาวสุนีนารถ พลซา', 'Suneenad.2529p@gmail.com', '82ca5dd156cc926b2992f73c2896f761', 'bUuUEh6jv0e0Bt7KHb3Leq7rbjdf2mB59SBLwBowK50', 'ภาควิชามนุษยศาสตร์', '1', 'Suneenad.jpg', '7', '1'),
(4, 'ผู้ปฏิบัติงานบริหาร', 'นางวันเพ็ญ บุญทะวงศ์', 'pwanpen@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '1', 'pimwanpenn.jpg', '7', '1'),
(5, 'นักวิชาการเงินและบัญชี', 'นางสาวจิรวรรณ บุตรเต', 'Jirawan.boo@lru.ac.th', '3e10f9cfe8030470e507965881025ab8', 'rQ9tRWQdE0idAik78hhs2NLx6nCV2DJJHLyId2oHNy8', 'สำนักงานคณะ', '1', 'Jirawan.jpg', '6', '1'),
(6, 'ผู้ปฏิบัติงานบริหาร', 'นางสาวมยุรี ก้อนคำใหญ่', 'fon.eak2540@gmail.com', 'abdccf2407662df969854a00a9424f27', 'k2by1tFScLyEQe3BE0rwK1Ehs8Iguhqu1JEGzXLEKpH', 'ภาควิชาสังคมศาสตร์', '1', 'fon.jpg', '6', '1'),
(7, 'นักวิชาการศึกษา', 'นางสาวศกุลตรา นามวงษ์', 'Sakultra.won@lru.ac.th', 'c1a93e1c78378f2503b9538a72213e60', 'vS0uNHy7YnYbuhEmcGW7l1UmAEj4klpi2704a44Y7Lt', 'สำนักงานคณะ', '1', 'Sakultra.jpg', '6', '1'),
(8, 'นักวิชาการศึกษา', 'นางสาวปุยฝ้าย อเนกบุณย์', 'puyfai_boon@hotmail.com', '52efebfd79c98ea8f60715d316fe04e8', 'j9MsMxY7NiJcvL8KFjmsRZFf58Mgi2wY3d7PFH5GCu3', 'สำนักงานคณะ', '1', 'puyfai.jpg', '6', '1'),
(9, 'นักวิชาการพัสดุ', 'นางสาวภัทร์ชยาวีร์ ศรีไตรภพ', 'varaphon_anny@hotmail.com', '257a27036b614b8b35441be13b50d5c1', '3NGxohyWM9beB1uVdr6xoSRC258D07ym4dj7xCre5Sp', 'สำนักงานคณะ', '1', 'varaphon.jpg', '6', '1'),
(10, 'ผู้ปฏิบัติงานบริหาร', 'นางสาวสุภาพร เมืองจันทร์', 'supaporn.mua@lru.ac.th', 'b59c67bf196a4758191e42f76670ceba', '7KAcExAKqVqjf2oy0hq3EoFZLoYuspAbTTn9IYSdqEh', 'สำนักงานคณะ', '1', 'supaporn.jpg', '6', '1'),
(11, 'นักวิทยาศาสตร์', 'นางสาววิภาพร สวัสดี', 'ning.n2541@gmail.com', '66ea6aa3c7bf78948b2965ca83729c06', 'fgLRHHPLWK2LeDvaxgpuGPxQi3OMjaRqMOF1f6ZCbHQ', 'ภาควิชาสังคมศาสตร์', '1', 'ning.jpg', '6', '1'),
(12, 'บรรณารักษ์', 'นางสาวศิริลักษณ์ ราชพัฒน์', 'Sirilux.rat@lru.ac.th', '42e9fb755426f19231217afb43e1aec1', 'bAXeRVtrIQhYW3JaQYDutK6rNeH6bOWPXgZt4kYAHeo', 'ภาควิชาสังคมศาสตร์', '1', 'Sirilux.jpg', '6', '1'),
(13, 'เจ้าหน้าที่บริหารงานทั่วไป', 'นางวิไลภรณ์ สีสมพร', 'Wilaiporn.ae07@gmail.com', '7c30a759d4d7730c78bc7b1f7e03c1fa', 'DcsYcevzb7dVZ5tTCzx0yePygwDGRlOZTRqoEuJWilY', 'สำนักงานคณะ', '1', 'Wilaiporn.jpg', '6', '1'),
(14, 'เจ้าหน้าที่บริการอัดสำเนา', 'นายครรชิต  จันทร์อ่อน', 'oemlove001@gmail.com', '1ed03ad8b3556a9f5cd2e0bc45cea67c', '4Br3Ep1MUVvWuLIz5L1LR9AV1E8GVXfJQ4072YiYcHn', 'สำนักงานคณะ', '1', 'oemlove001.jpg', '6', '1'),
(15, 'สาขาวิชาภาษาอังกฤษ', 'อาจารย์ชัยศนันทน์ สมปัญญาธิวงศ์', 'chaisanan.sam.lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'chaisanan.jpg', '', '0'),
(16, 'สาขาวิชาภาษาอังกฤษ', 'อาจารย์กรรณศาสตร์ แก้วแสนทิพย์', 'human@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'human.jpg', '', '0'),
(17, 'สาขาวิชาภาษาอังกฤษ', 'ผู้ช่วยศาสตราจารย์ ดร.พัชรินทร์ ดวงศรี', 'patcharin.dua@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'patcharin.jpg', '', '0'),
(18, 'สาขาวิชาภาษาอังกฤษ', 'อาจารย์เอื้องไพร วัลลภาชัย', 'human@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'human.jpg', '', '0'),
(19, 'สาขาวิชาภาษาอังกฤษ', 'ดร.พนิดา ตาสี', 'panida.tas@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', 'qBdspzm34U7clUtqCTtqFTU7rvc4W9LhE6T0bl7CQFA', 'ภาควิชามนุษยศาสตร์', '2', 'panida.jpg', '', '1'),
(20, 'สาขาวิชาภาษาอังกฤษ', 'อาจารย์มัสยา ราชวงษ์', 'massaya.rat@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'massaya.jpg', '', '0'),
(21, 'สาขาวิชาภาษาอังกฤษ', 'Mr.Rene Zumstein', 'human@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'human.jpg', '', '0'),
(22, 'สาขาวิชาภาษาอังกฤษธุรกิจ', 'ผู้ช่วยศาสตราจารย์ชมพูนุท ธีราวิทย์', 'pt2554040@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', 'YrUI3YvzznsCvwbVr7cULa4fu6LzVRBrWQ4i3hQ5uFC', 'ภาควิชามนุษยศาสตร์', '2', 'pt2554040.jpg', '', '1'),
(23, 'สาขาวิชาภาษาอังกฤษธุรกิจ', 'อาจารย์อารีย์ ลำมะยศ', 'aree.lan@lru.ac.th', 'def5d03b16bd1c867a2b94960aaead15', '', 'ภาควิชามนุษยศาสตร์', '3', 'aree.jpg', '8', '1'),
(24, 'สาขาวิชาภาษาอังกฤษธุรกิจ', 'อาจารย์ปัทมา ปัญญาใส', 'pattama.pan@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'pattama.jpg', '', '0'),
(25, 'สาขาวิชาภาษาอังกฤษธุรกิจ', 'อาจารย์สมศักดิ์ จันทดี', 'somsak.jan@lru.ac.th', '0a5119b3aab267170bd1dd400f29a0f5', '', 'ภาควิชามนุษยศาสตร์', '2', 'somsak.jpg', '', '1'),
(26, 'สาขาวิชาภาษาอังกฤษธุรกิจ', 'อาจารย์ณศิริ ศิริพริมา', 'nsriry.sri@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'nsriry.jpg', '', '0'),
(27, 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', 'อาจารย์ธิราภรณ์ สุทธศรี', 'tiraphorn.sut@lru.ac.th', '5ab0a46edfa8c95d151a957237517dc9', '', 'ภาควิชามนุษยศาสตร์', '2', 'tiraphorn.jpg', '', '1'),
(28, 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', 'อาจารย์ศุภกานต์ บำรุงราชหิรัณย์', 'supkarn.bam@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'supkarn.jpg', '', '0'),
(29, 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', 'ผู้ช่วยศาสตราจารย์ ดร.ศรีจิตรา นวรัตนาภรณ์', 'sijittra.nav@lru.ac.th', 'e3dfb7bf1d325570dadc7525bc1cb307', 'E5ppJ3DyjBoDxCCV3kPdRmUYZPFV2ra7uc2gZT0tv8h', 'ภาควิชามนุษยศาสตร์', '2', 'sijittra.jpg', '', '1'),
(30, 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', 'อาจารย์สุรพิชญา ราชพรหมมา', 'surapitchaya.rad@lru.ac.th', '9e6bae2cd52613d38a0eb19f1775be43', 'khMTOtd7ZqEE6VbX0j1NXSs0jCywJm1NaoQ552AjWDv', 'ภาควิชามนุษยศาสตร์', '2', 'surapitchaya.jpg', '', '1'),
(31, 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', 'อาจารย์กุลธิดา ธนกัญญา', 'kunthida.tha@lru.ac.th', '0675085738570e26f5c52920114b791d', 'zsjTzYwV8FMvSfdNViwiTOe4pJxq6Ja6iklqcwFelPq', 'ภาควิชามนุษยศาสตร์', '2', 'kunthida.jpg', '', '1'),
(32, 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', 'อาจารย์ณัฐนันท์ สุ่มมาตย์', 'natthanan.sum@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'natthanan.jpg', '', '0'),
(33, 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', 'อาจารย์ฐปนรักษ์ ศรีทารัง', 'thapanaruk.sri@lru.ac.th', 'df15b9c1af165c8a4ce233770da539a4', 'h9VRFC6CbX4ZIFdWZbhRKsodL16eklll1YV61SuoyQl', 'ภาควิชามนุษยศาสตร์', '2', 'thapanaruk.jpg', '', '1'),
(34, 'สาขาวิชาภาษาไทย', 'อาจารย์วรางคณา ทวีวรรณ', 'warhagkhana.taw@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'warhagkhana.jpg', '', '0'),
(35, 'สาขาวิชาภาษาไทย', 'รองศาสตราจารย์ ดร.พรสวรรค์ ศิริกัญจนาภรณ์', 'pornsavarn.sir@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'pornsavarn.jpg', '', '0'),
(36, 'สาขาวิชาภาษาไทย', 'ผู้ช่วยศาสตราจารย์ ดร.พยุงพร ศรีจันทวงษ์', 'payungporn.sri@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'payungporn.jpg', '', '0'),
(37, 'สาขาวิชาภาษาไทย', 'ผู้ช่วยศาสตราจารย์ ดร.สุรธัชนุกูล นุ่นภูบาล', 'surathadchanukoon.nun@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'surathadchanukoon.jpg', '', '0'),
(38, 'สาขาวิชาภาษาไทย', 'ผู้ช่วยศาสตราจารย์วิชชุพงศ์ วรศาสตร์กุล', 'pt5650200053901@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'pt5650200053901.jpg', '', '0'),
(39, 'สาขาวิชาภาษาไทย', 'ผู้ช่วยศาสตราจารย์พชรมณ ใจงามดี', 'pacharamon.jai@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'pacharamon.jpg', '', '0'),
(40, 'สาขาวิชาบรรณารักษศาสตร์และภาษาอังกฤษ', 'อาจารย์อรนิต เชี่ยวเวทย์', 'oranit.pra@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'oranit.jpg', '', '0'),
(41, 'สาขาวิชาบรรณารักษศาสตร์และภาษาอังกฤษ', 'รองศาสตราจารย์ ดร.นัยนา อรรจนาทร', 'naiyana.aja@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'naiyana.jpg', '', '0'),
(42, 'สาขาวิชาบรรณารักษศาสตร์และภาษาอังกฤษ', 'ผู้ช่วยศาสตราจารย์ ดร.สุขุม พรมเมืองคุณ', 'sukhum.pro@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'sukhum.jpg', '', '0'),
(43, 'สาขาวิชาบรรณารักษศาสตร์และภาษาอังกฤษ', 'อาจารย์ปาริชาติ แสงระชัฏ', 'parichart.san@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'parichart.jpg', '', '0'),
(44, 'สาขาวิชาบรรณารักษศาสตร์และภาษาอังกฤษ', 'ดร.กนกพร นาสมตรึก ซิมิโอนิกะ', 'kanokpornnasomtrug.sim@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'kanokpornnasomtrug.jpg', '', '0'),
(45, 'สาขาวิชาดุริยางคศิลป์', 'อาจารย์พงศ์พัฒน์ เหล่าคนค้า', 'phongphat.lao@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'phongphat.jpg', '', '0'),
(46, 'สาขาวิชาดุริยางคศิลป์', 'ผู้ช่วยศาสตราจารย์คชสีห์ เจริญสุข', 'kotchasi.cha@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'kotchasi.jpg', '', '0'),
(47, 'สาขาวิชาดุริยางคศิลป์', 'อาจารย์พงษ์พันธ์ เสาวดี', 'pongpun.sao@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'pongpun.jpg', '', '0'),
(48, 'สาขาวิชาดุริยางคศิลป์', 'อาจารย์ชานน สืบสม', 'chanon.sue@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'chanon.jpg', '', '0'),
(49, 'สาขาวิชาดุริยางคศิลป์', 'อาจารย์ศุภวุฒิ พิมพ์นนท์', 'suphawut.phi@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'suphawut.jpg', '', '0'),
(50, 'สาขาวิชาดิจิทัลอาร์ต', 'ผู้ช่วยศาสตราจารย์ ดร.อิสริยาภรณ์ ชัยกุหลาบ', 'itsariyaphon.cha@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', 'OUQYQiPcIwJGBJY6NcfRu9AtJ6EQ6hWu1hUadVoGNPe', 'ภาควิชามนุษยศาสตร์', '2', 'itsariyaphon.jpg', '', '1'),
(51, 'สาขาวิชาดิจิทัลอาร์ต', 'ผู้ช่วยศาสตราจารย์ศรัณยพัชร์ จิตพิไล', 'saranyaphach.jit@lru.ac.th', 'c318f8b8f0a87ceecf03730eb926fd48', 'iLZGtZ4quDoMGbD1p9sFmvafACVHrU7lnDd9mo2x4Zt', 'ภาควิชามนุษยศาสตร์', '2', 'saranyaphach.jpg', '', '1'),
(52, 'สาขาวิชาดิจิทัลอาร์ต', 'อาจารย์ธีระพงษ์ พิทักษ์ศฤงคาร', 'teerapong.pit@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'teerapong.jpg', '', '0'),
(53, 'สาขาวิชาดิจิทัลอาร์ต', 'ผู้ช่วยศาสตราจารย์ชัยทวี บุบผา', 'chaitawee.bub@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'chaitawee.jpg', '', '0'),
(54, 'สาขาวิชาทัศนศิลป์', 'รองศาสตราจารย์ไทยโรจน์ พวงมณี', 'thairos.pho@lru.ac.th', 'd41d8cd98f00b204e9800998ecf8427e', '', 'ภาควิชามนุษยศาสตร์', '2', 'thairos.jpg', '', '1'),
(55, 'สาขาวิชาทัศนศิลป์', 'อาจารย์ยุพดี ผ่องศรี', 'yupadee.pho@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', 'lsX7mbHVHN0BUPOz7E4kmjCfEHFRwVOlHKpjmluqguZ', 'ภาควิชามนุษยศาสตร์', '2', 'yupadee.jpg', '', '1'),
(56, 'สาขาวิชาทัศนศิลป์', 'อาจารย์สิทธิวัฒน์ มีคำวัน', 'sittiwat.mee@lru.ac.th', '1a5edc6251971a112d6ccc9b4ebc024b', 'vc10ar591a7RA3KWmZrxq9rjk5rPkR5XZk0PdEoGqPz', 'ภาควิชามนุษยศาสตร์', '2', 'sittiwat.jpg', '', '1'),
(57, 'สาขาวิชาทัศนศิลป์', 'อาจารย์พายุ แฝงทรัพย์', 'payu.fae@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'payu.jpg', '', '0'),
(58, 'สาขาวิชาทัศนศิลป์', 'อาจารย์ธัญชนก หอมสวาสดิ์', 'thanchanok.hom@lru.ac.th', 'e39bbfa51d2ba3b30618065afb7fb06b', 'mPi6N4cSp1y3PcSD6roFoiRrCy2uS11GjfyIKZtoQK8', 'ภาควิชามนุษยศาสตร์', '2', 'human.jpg', '', '1'),
(59, 'กลุ่มภาษาต่างประเทศ', 'Mr.Brian J ackson', 'brianalvin.jac@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'brianalvin.jpg', '', '0'),
(60, 'กลุ่มภาษาต่างประเทศ', 'Mr.Kevan R Dodd', 'kevanrobert.dod@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'kevanrobert.jpg', '', '0'),
(61, 'กลุ่มภาษาต่างประเทศ', 'Mr.Kym Fabian', 'kymdavid.fab@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'kymdavid.jpg', '', '0'),
(62, 'สังกัดมนุษศาสตร์และสังคมศาสตร์', 'ดร.กอบกาญจน์ กัปตพล', 'kobkhan.gub@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชามนุษยศาสตร์', '2', 'kobkhan.jpg', '', '0'),
(63, 'สาขาวิชารัฐประศาสนศาสตร์', 'อาจารย์อารีรัตน์ โฮมประเสริฐ', 'areerat.hom@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'areerat.jpg', '', '0'),
(64, 'สาขาวิชารัฐประศาสนศาสตร์', 'ผู้ช่วยศาสตราจารย์ ดร.กัลยา ยศคำลือ', 'kalaya.yot@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'kalaya.jpg', '', '0'),
(65, 'สาขาวิชารัฐประศาสนศาสตร์', 'ผู้ช่วยศาสตราจารย์ ดร.ธนภัทร ใจเย็น', 'thanapatra.jai@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'thanapatra.jpg', '', '0'),
(66, 'สาขาวิชารัฐประศาสนศาสตร์', 'ผู้ช่วยศาสตราจารย์มาณพ ประวาลลัญฉกร', 'manop.pra@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'manop.jpg', '', '0'),
(67, 'สาขาวิชารัฐประศาสนศาสตร์', 'อาจารย์กุลขณิษฐ์ อดิรุจโชติสิริ', 'kunkhanit.adi@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'kunkhanit.jpg', '', '0'),
(68, 'สาขาวิชารัฐประศาสนศาสตร์', 'อาจารย์ทรัพย์อนันต์ พละบุตร', 'subanun.pal@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'subanun.jpg', '', '0'),
(69, 'สาขาวิชารัฐประศาสนศาสตร์', 'อาจารย์ธีรวัฒน์ วงศ์วรัญญู', 'teerawat.won@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'teerawat.jpg', '', '0'),
(70, 'สาขาวิชารัฐประศาสนศาสตร์', 'อาจารย์เลแกน สุธรรม', 'lagan.sut@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'lagan.jpg', '', '0'),
(71, 'สาขาวิชารัฐประศาสนศาสตร์', 'อาจารย์มนตรี คำวัน', 'montri.kha@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'montri.jpg', '', '0'),
(72, 'สาขาวิชาการพัฒนาชุมชน', 'อาจารย์อริศราวรรณ นิยมรัตน์จรูญ', 'arisaravan.niy@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'arisaravan.jpg', '', '0'),
(73, 'สาขาวิชาการพัฒนาชุมชน', 'ผู้ช่วยศาสตราจารย์ ดร.สมพงษ์ ดุลยอนุกิจ', 'sompong.dul@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'sompong.jpg', '', '0'),
(74, 'สาขาวิชาการพัฒนาชุมชน', 'ผู้ช่วยศาสตราจารย์ผการัตน์ พินิจวัฒน์', 'phakaratn.bhi@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'phakaratn.jpg', '', '1'),
(75, 'สาขาวิชาการพัฒนาชุมชน', 'ดร.ภูมิ เพชรกาญจนาพงศ์', 'phoome.pet@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'phoome.jpg', '', '0'),
(76, 'สาขาวิชานิติศาสตร์', 'อาจารย์ดวงพร บุญเลี้ยง', 'duangporn.boo@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'duangporn.jpg', '', '0'),
(77, 'สาขาวิชานิติศาสตร์', 'ผู้ช่วยศาสตราจารย์เมธาคุณ พฤกษา', 'metakhun.pru@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'metakhun.jpg', '', '0'),
(78, 'สาขาวิชานิติศาสตร์', 'อาจารย์วีระยุทธ สุโขยะชัย', 'weerayut.suk@lru.ac.th', 'd28b2fda98df88f5f6e6e16a91bfc52b', '', 'ภาควิชาสังคมศาสตร์', '3', 'weerayut.jpg', '8', '1'),
(79, 'สาขาวิชานิติศาสตร์', 'อาจารย์ปิยะพร ศรีวิชา', 'piyaporn.sri@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'piyaporn.jpg', '', '0'),
(80, 'สาขาวิชานิติศาสตร์', 'อาจารย์ปิยวรรณ เสนาเจริญ', 'human@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'human.jpg', '', '0'),
(81, 'สาขาวิชานิติศาสตร์', 'ดร.เยาวพา กองเกตุ', 'yaowapa.kon@lru.ac.th', 'b59c67bf196a4758191e42f76670ceba', '', 'ภาควิชาสังคมศาสตร์', '9', 'yaowapa.jpg', '99', '1'),
(82, 'สาขาวิชานิติศาสตร์', 'ผู้ช่วยศาสตราจารย์ธีระศักดิ์ เชี่ยวเวทย์', 'teerasak.chi@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'teerasak.jpg', '', '0'),
(83, 'สาขาวิชานิติศาสตร์', 'อาจารย์กรุณา ทาแก้ว', 'karuna.tak@lru.ac.th', '1175defd049d3301e047ce50d93e9c7a', '', 'ภาควิชาสังคมศาสตร์', '2', 'human.jpg', '', '1'),
(84, 'สาขาวิชานิติศาสตร์', 'อาจารย์พุฒิพร เจียรประวัติ', 'puttiporn.jea@lru.ac.th', '9548725eb4e99d1636cdb4cb35497097', '', 'ภาควิชาสังคมศาสตร์', '2', 'puttiporn.jpg', '', '1'),
(85, 'สาขาวิชาสังคมศึกษา', 'ดร.ธีระวัฒน์ แสนคำ', 'teerawatt.san@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'teerawatt.jpg', '', '0'),
(86, 'สาขาวิชาสังคมศึกษา', 'ผู้ช่วยศาสตราจารย์ ดร.ยิ่งศักดิ์ คชโคตร', 'yingsak.kho@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'yingsak.jpg', '', '0'),
(87, 'สาขาวิชาสังคมศึกษา', 'ผู้ช่วยศาสตราจารย์ ดร.พุทธิวัฒน์ ถาวรสินศักดิ์', 'sakhorn.phr@lru.ac.th', 'b59c67bf196a4758191e42f76670ceba', 'bscC2r4jbQ0AzrzcJIlhILqwXsuz0I9y1ctvWZe6HOr', 'ภาควิชาสังคมศาสตร์', '2', 'sakhorn.jpg', '', '1'),
(88, 'สาขาวิชาสังคมศึกษา', 'ผู้ช่วยศาสตราจารย์บุญวัฒน์ บุญทะวงศ์', 'boonyawat.boo@lru.ac.th', '912450aa2d4969bc320ae19356411c39', '', 'ภาควิชาสังคมศาสตร์', '2', 'boonyawat.jpg', '', '1'),
(89, 'สังกัดมนุษศาสตร์และสังคมศาสตร์', 'อาจารย์กันตพงษ์ จุลราช', 'chit.jun@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'ภาควิชาสังคมศาสตร์', '2', 'chit.jpg', '', '0'),
(128, 'สาขาวิชาภาษาอังกฤษ', 'นายณัฐกร หิรัญโท', 'natthakon.hir@lru.ac.th', '08aa3ab3648b4f4778b03bf94185a22a', 'PdQInkyVjkPKWidsIO8vf7h8HAl4AnqrZcnrBs6LXNU', 'ภาควิชามนุษยศาสตร์', '2', 'natthakon.jpg', '', '1'),
(129, 'พัฒนาสังคม ป.โท', 'ดร.เกรียงศักดิ์ สร้อยสุวรรณ', 'kriangsak.soi@lru.ac.th', '81dc9bdb52d04dc20036dbd8313ed055', '', 'บัณฑิตศึกษา', '2', 'kriangsak.jpg', '', '0'),
(130, 'ภาษาอังกฤษ ป.โท', 'ดร.วิไล ผิวมา', 'wilai.phi@lru.ac.th', '6de7e96837f1909a87e32be97ab835d8', '', 'บัณฑิตศึกษา', '', 'wilai.jpg', '', '1');

-- --------------------------------------------------------

--
-- Table structure for table `memo`
--

CREATE TABLE `memo` (
  `id` int(10) NOT NULL,
  `dep` varchar(100) NOT NULL,
  `field` varchar(100) NOT NULL,
  `user_id` varchar(10) NOT NULL,
  `memo_id` varchar(10) NOT NULL,
  `memo_num_dep` varchar(20) NOT NULL,
  `memo_date` varchar(50) NOT NULL,
  `title` varchar(200) NOT NULL,
  `paragraph1` text NOT NULL,
  `paragraph2` text NOT NULL,
  `paragraph3` text NOT NULL,
  `sign` varchar(100) NOT NULL,
  `time_user` varchar(50) NOT NULL,
  `sign_officer` varchar(250) NOT NULL,
  `time_officer` varchar(50) NOT NULL,
  `sign_officer1` varchar(250) NOT NULL,
  `time_officer1` varchar(50) NOT NULL,
  `name` varchar(250) NOT NULL,
  `position` varchar(250) NOT NULL,
  `status` char(1) NOT NULL,
  `status_edit` char(1) NOT NULL,
  `comment1` varchar(250) NOT NULL,
  `comment2` varchar(250) NOT NULL,
  `sign_depart` varchar(250) NOT NULL,
  `depart_opinion` text NOT NULL,
  `depart_opinion_time` varchar(50) NOT NULL,
  `memo_num_officer1` varchar(100) NOT NULL,
  `comment3` varchar(250) NOT NULL,
  `officer1_opinion` varchar(250) NOT NULL,
  `comment4` varchar(250) NOT NULL,
  `sign_head_officer` varchar(250) NOT NULL,
  `head_officer_opinion` text NOT NULL,
  `head_officer_opinion_time` varchar(100) NOT NULL,
  `sign_admin` varchar(250) NOT NULL,
  `admin_opinion` varchar(250) NOT NULL,
  `admin_opinion_time` varchar(100) NOT NULL,
  `comment5` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `memo`
--

INSERT INTO `memo` (`id`, `dep`, `field`, `user_id`, `memo_id`, `memo_num_dep`, `memo_date`, `title`, `paragraph1`, `paragraph2`, `paragraph3`, `sign`, `time_user`, `sign_officer`, `time_officer`, `sign_officer1`, `time_officer1`, `name`, `position`, `status`, `status_edit`, `comment1`, `comment2`, `sign_depart`, `depart_opinion`, `depart_opinion_time`, `memo_num_officer1`, `comment3`, `officer1_opinion`, `comment4`, `sign_head_officer`, `head_officer_opinion`, `head_officer_opinion_time`, `sign_admin`, `admin_opinion`, `admin_opinion_time`, `comment5`) VALUES
(1, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาภาษาอังกฤษ', '15', '0001', 'ภม.012/64', '2 มี.ค. 2565', 'ขออนุญาตดำเนินโครงการย่อย', 'ตามที่มหาวิทยาลัยราชภัฏเลยได้อนุมัติงบประมาณแผนงานโครงการยกระดับเศรษฐกิจและสังคมรายตำบลแบบบูรณาการ (มหาวิทยาลัยสู่ตำบล สร้างรากแก้วให้ประเทศ : U2T) มหาวิทยาลัยราชภัฏเลย โครงการย่อย “โครงการธนาคารขยะชุมชน สร้างความมั่นคงให้ครอบครัว พัฒนาชุมชนอย่างยั่งยืน” จำนวนงบประมาณทั้งสิ้น 88,480 บาท (แปดหมื่นแปดพันสี่ร้อยสี่สิบแปดบาทถ้วน) ไปแล้วนั้น', '', 'จึงเรียนมาเพื่อโปรดพิจารณาอนุมัติ', 'AAAAAAAAA', '02:01', 'สุนีนารถ พลซา', '15:11', '', '', 'อาจารย์ชัยศนันทน์ สมปัญญาธิวงศ์', 'ชัยศนันทน์ สมปัญญาธิวงศ์', '2', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:42', '', '', '', '', '', '', '', '', '', '', ''),
(2, 'สำนักงานคณะ', 'ผู้ปฏิบัติงานบริหาร', '10', '0002', '', '2 ม.ค. 2565', 'ขออนุญาตเปลี่ยนแปลงวันที่ดำเนินโครงการ', 'ตามบันทึกข้อความที่ 07775 ลงวันที่ 25 ตุลาคม 2564 มหาวิทยาลัยราชภัฏเลยได้อนุมัติดำเนิน โครงการธนาคารขยะชุมชน สร้างความมั่นคงให้ครอบครัว พัฒนาชุมชนอย่างยั่งยืน” จำนวนงบประมาณทั้งสิ้น 88,480 บาท (แปดหมื่นแปดพันสี่ร้อยสี่สิบแปดบาทถ้วน) ไปแล้วนั้น เนื่องด้วยในวันที่ 28 พฤศจิกายน 2564 สำนักงานคณะกรรมการการเลือกตั้ง (กกต.) กำหนดให้มีการเลือกตั้งสมาชิกสภาองค์การบริหารส่วนตำบลและนายกองค์การบริหารส่วนตำบล (อบต.) จึงทำให้กลุ่มชาวบ้านและวิทยากรที่จะเข้าร่วมกิจกรรมในวันที่ 28 พฤศจิกายน 2564 นั้นไม่สามารถมาเข้าร่วมกิจกรรมได้ ดังนั้นจึงขอเปลี่ยนแปลงวันที่ดำเนินโครงการธนาคารขยะชุมชน สร้างความมั่นคงให้ครอบครัว พัฒนาชุมชนอย่างยั่งยืน เป็นวันที่ 1 ธันวาคม 2564  ดังรายละเอียดที่แนบมาพร้อมนี้', '', 'จึงเรียนมาเพื่อโปรดพิจารณาอนุมัติ', 'สุภาพร เมืองจันทร์', '10:40', '', '', 'กุสุมา อินทรา', '10:42', 'นางสาวสุภาพร เมืองจันทร์', 'ผู้ปฏิบัติงานบริหาร', '5', '', '', '', '', '', '', 'มศ.001/64', '', '', '', 'บัวบาล', 'เห็นควรอนุญาต', '10:45', 'ดร.เยาวพา กองเกตุ', 'อนุญาต', '10:47', ''),
(3, 'ภาควิชาสังคมศาสตร์', 'ผู้ปฏิบัติงานบริหาร', '6', '0003', '', '2 ม.ค. 2565', 'ขอเรียนเชิญเป็นวิทยากร', 'ด้วยสาขาวิชาสาขาวิชาดิจิทัลอาร์ต ภาควิชามนุษยศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์ มหาวิทยาลัยราชภัฏเลย ได้จัดทำโครงการย่อยที่ ๑“การอบรมเรื่องการเลี้ยงไส้เดือนดิน”  ภายใต้โครงการยุทธศาสตร์มหาวิทยาลัยราชภัฏเพื่อการพัฒนาท้องถิ่น มหาวิทยาลัยราชภัฏเลย   ประจำปีงบประมาณ  พ.ศ. ๒๕๖๕  โดยมีวัตถุประสงค์เพื่อส่งเสริมอาชีพการเลี้ยงไส้เดือนดินของชุมชน และเพื่อพัฒนาเศรษฐกิจระดับชุมชน ก่อให้เกิดเพิ่มรายได้เสริม และลดรายจ่ายให้กับคนในชุมชน  ', 'ในการนี้  สาขาวิชาสาขาวิชาดิจิทัลอาร์ต ภาควิชามนุษยศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์ มหาวิทยาลัยราชภัฏเลย  ได้พิจารณาแล้วเห็นว่าท่านเป็นผู้มีความรู้  ความสามารถ  และประสบการณ์ในเรื่องดังกล่าว จึงขอเรียนเชิญท่านเป็นวิทยากรบรรยายในหัวข้อ  “ความรู้ทั่วไปเกี่ยวกับไส้เดือนดิน  การเลี้ยงไส้เดือนดิน การจัดการระบบการดูแลไส้เดือนดิน และการผลิตปุ๋ยมูลไส้เดือนดินและน้ำหมักมูลไส้เดือนดิน” ในวันเสาร์ที่  ๑๙  มีนาคม  ๒๕๖๕  ตั้งแต่เวลา  ๐๘.๐๐ – ๑๗.๐๐ น. ณ บ้านทุ่งใหญ่  ตำบลภูกระดึง อำเภอภูกระดึง จังหวัดเลย  รายละเอียดตามกำหนดการที่แนบมาพร้อมนี้', 'จึงเรียนมาเพื่อโปรดพิจารณาและขอขอบคุณมา  ณ  โอกาสนี้', 'มยุรี  ก้อนคำใหญ่', '11:40', '', '', 'กุสุมา', '15:11', 'นางสาวมยุรี ก้อนคำใหญ่', 'เจ้าหน้าที่', '4', '', '', '', 'วีระยุทธ', ' ', '15:04', 'มศ.005/64', '', '', '', 'บัวบาล', '', '15:16', '', '', '', ''),
(4, 'สำนักงานคณะ', 'นักวิชาการศึกษา', '8', '0004', '', '2 ม.ค. 2565', 'ขออนุญาตไปราชการ', 'ตามที่สาขาวิชายุทธศาสตร์การพัฒนาภูมิภาค', 'ในการนี้จึงขออนุญาตไปราชการ', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ผศ.ดร.พรกมล ระหาญนอก', '11:15', '', '', 'กุสุมา', '10:58', 'นางสาวปุยฝ้าย อเนกบุณย์', 'นักวิชาการศึกษา', '4', '', '', '', '', '', '', 'มศ.003/64', '', '', '', 'บัวบาล', '', '11:21', '', '', '', ''),
(5, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาดิจิทัลอาร์ต', '51', '0005', 'ภม.001/64', '2 ม.ค. 2565', 'ขอเสนอเปิดรายวิชาเลือกเสรี สำหรับนักศึกษาระดับปริญญาตรี ในปีการศึกษา ๓/๒๕๖๔', 'ด้วยสาขาวิชาดิจิตอลอาร์ต ภาควิชามนุษยศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์  มหาวิทยาลัยราชภัฏเลย ข้าพเจ้าผู้ช่วยศาสตราจารย์ศรัณยพัชร์ จิตพิไล มีความประสงค์จะขอเปิดรายวิชาเลือกเสรี ๒๐๔๒๕๐๗ การถ่ายภาพแฟชั่น สำหรับนักศึกษาระดับปริญญาตรี ในปีการศึกษา ๒๕๖๔ เป็นต้นไป \r\nเพื่อให้การดำเนินการเปิดรายวิชาเป็นไปด้วยความเรียบร้อย โดยจะขอเปิดการเรียนการสอนในรายวิชาดังกล่าวตามตารางวิชาเลือกเสรี คือทุกวันอังคาร ในคาบที่ ๘ – ๑๑ ที่ห้องสตูดิโอภาพนิ่ง อาคารภาคศิลป์ คณะมนุษยศาสตร์และสังคมศาสตร์ และย้ายรายวิชา ๒๐๓๒๒๐๔ ภาพวาดคาแรคเตอร์การ์ตูนและการ์ตูนเล่าเรื่อง หมู่เรียน ศป.๖๒๐๓ ไปเป็นทุกวันศุกร์ ในคาบที่ ๑๑ – ๑๔ ที่ห้องคอม ๑๐๕ อาคารศูนย์คอมพิวเตอร์ฯ หรือตามห้องเรียนที่ว่าง รายละเอียดดังเอกสารแนบ\r\n', '', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ผู้ช่วยศาสตราจารย์ศรัณยพัชร์ จิตพิไล', '11:09', 'สุนีนารถ พลซา', '15:57', 'กุสุมา', '15:46', 'ผู้ช่วยศาสตราจารย์ศรัณยพัชร์ จิตพิไล', 'อาจารย์ผู้สอนในรายวิชาเลือกเสรี', '2', '', '', '', 'อารีย์ ลำมะยศ', ' ', '16:00', 'มศ.007/64', '', '', '', 'บัวบาล', 'ผ่าน', '11:08', 'ดร.เยาวพา กองเกตุ', 'อนุมัติ', '11:12', ''),
(6, 'สำนักงานคณะ', 'นักวิชาการศึกษา', '7', '0006', '', '2 ม.ค. 2565', 'ขออนุญาตไปราชการ', 'ตามที่คณะมนุษย์ศาสตร์และสังคมศาสตร์', 'ในการนี้ 12 เนื่องจาก….', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ปุยฝ้าย', '11:06', '', '', 'กุสุมา', '10:56', 'นางสาวศกุลตรา นามวงษ์', 'นักวิชาการศึกษา', '5', '', '', '', '', '', '', 'มศ.002/64', '', '', '', 'บัวบาล', '', '11:07', 'ดร.เยาวพา กองเกตุ', 'อนุมัติ', '11:12', ''),
(7, 'สำนักงานคณะ', 'เจ้าหน้าที่บริหารงานทั่วไป', '13', '0007', '', '2 ม.ค. 2565', 'ขออนุญาตไปราชการ', 'ตามที่คณะมนุษย์ศาสตร์และสังคมศาสตร์ ได้ดำเนินโครงการบริการวิชาการ …ในพื้นที่', 'จึงขออนุญาตไปราชการ ในวันที่ 3-4 ก.พ. 64  เพื่อบริการวิชาการในพื้นที่เป้าหมาย..', 'จึงเรียนมาเพื่อโปรดพิจารณาอนุญาต', 'นายทรัพย์อนันต์  พละบุตร', '11:31', '', '', 'กุสุมา', '15:46', 'นางวิไลภรณ์ สีสมพร', 'เจ้าหน้าที่บริหารงานทั่วไป', '4', '', '', '', '', '', '', 'มศ.004/64', '', '', '', 'บัวบาล', '', '15:48', '', '', '', ''),
(8, 'ภาควิชาสังคมศาสตร์', 'นักวิทยาศาสตร์', '11', '0008', '', '2 มี.ค. 2565', 'ขอรับการสนับสนุนครุภัณฑ์เพื่อใช้ในห้องสมุดสาขาวิชานิติศาสตร์  ศูนย์การศึกษามหาวิทยาลัย  ราชภัฏเลย  จังหวัดขอนแก่น ', 'ตามบันทึกข้อความสาขาวิชานิติศาสตร์ ภาควิชาสังคมศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์ ที่ มส.๑๘๔๓/๒๕๖๔ เรื่อง ขออนุญาตใช้ห้องเรียน CL๓๐๑-CL๓๐๔ อาคารเรียนรวม CL๐๑    เพื่อเป็นการเตรียมความพร้อมจัดสรรพื้นที่สำหรับใช้ในการจัดการเรียนการสอน  และในการรองรับการประเมินคุณภาพจากองค์กรวิชาชีพ ณ ศูนย์การศึกษามหาวิทยาลัยราชภัฎเลย จังหวัดขอนแก่น ทั้งในภาคปกติและภาคพิเศษ ไปแล้วนั้น ', 'เพื่อให้การจัดการเรียนการสอนของสาขาวิชานิติศาสตร์เกิดประสิทธิภาพสูงสุด         สาขาวิชานิติศาสตร์จึงขอรับการสนับสนุนครุภัณฑ์จากสำนักวิทยบริการและเทคโนโลยีสารสนเทศ เพื่อใช้ในห้องสมุดสาขาวิชานิติศาสตร์ ณ ศูนย์การศึกษามหาวิทยาราชภัฏเลย  จังหวัดขอนแก่น  ดังนี้ \r\n๑. โต๊ะอ่านหนังสือเดี่ยวพร้อมเก้าอี้ ๑๐ ชุด\r\n๒. โต๊ะอ่านหนังสือ ๘ ตัว พร้อมเก้าอี้ ๑๖ ตัว\r\n๓. ตู้ชั้นหนังสือ ๖ ตู้ \r\nรายละเอียดปรากฎตามเอกสารที่แนบมาพร้อมนี้    \r\n\r\n', 'จึงเรียนมาเพื่อโปรดทราบและพิจารณา \r\n', 'นางสาวปิยวรรณ  เสนาเจริญ', '10:43', '', '', 'กุสุมา', '11:00', 'นางสาววิภาพร สวัสดี', 'ผู้ปฏิบัติงาน', '', '1', '', '', '', '', '', 'มศ.006/64', '', '', '', '', '', '', '', '', '', ''),
(9, 'ภาควิชาสังคมศาสตร์', 'บรรณารักษ์', '12', '0009', '', '2 มี.ค. 2565', 'ขอให้ลงนามในหนังสือขอขอบคุณ', 'ด้วยสาขาวิชานิติศาสตร์ได้รับมอบวารสารวิชาการ จากคณะนิติศาสตร์ มหาวิทยาลัยราชภัฏอุบลราชธานี และคู่มือล่ามในกระบวนการยุติธรรมและแบบรายงานผลดำเนินการใช้บัญชีล่ามในกระบวนการยุติธรรมของกรมคุ้มครองสิทธิและเสรีภาพ จากกรมคุ้มครองสิทธิและเสรีภาพ นั้น', 'เพื่อให้การดำเนินการเรื่องดังกล่าวเป็นไปด้วยความเรียบร้อย จึงขอให้ท่านลงนามในหนังสือขอขอบคุณ  เพื่อสาขาวิชาจะได้ดำเนินการต่อไป', ' จึงเรียนมาเพื่อโปรดพิจารณา', 'นางสาวปิยวรรณ  เสนาเจริญ', '10:50', '', '', 'กุสุมา', '12:09', 'นางสาวศิริลักษณ์ ราชพัฒน์', 'ประธานกรรมการผู้รับผิดชอบหลักสูตรนิติศาสตรบัณฑิต สาขาวิชานิติศาสตร์', '4', '', '', '', '', '', '', 'มศ.009/64', '', '', '', '[บัวบาล', '', '14:24', '', '', '', ''),
(10, 'สำนักงานคณะ', 'นักวิชาการเงินและบัญชี', '5', '0010', '', '2 ม.ค. 2565', 'ขอเชิญประชุมเรื่องจัดสรรงบประมาณปี2565', 'ด้วยมหาวิทยาลัยได้จัดสรรงบประมาณประจำปี2565', 'จึงจอเขิญประชุม', 'เรียนมาโปรดเข้าร่วมประชุม', 'ดร.เยาวพา กองเกตุ', '11:05', '', '', 'กุสุมา', '11:08', 'นางสาวจิรวรรณ บุตรเต', 'นักวิชาการเงินและบัญชี', '', '1', '', '', '', '', '', 'มศ.008/64', '', '', '', '', '', '', '', '', '', ''),
(11, 'ภาควิชามนุษยศาสตร์', 'ภาควิชามนุษยศาสตร์', '3', '0011', 'ภม.002/64', '2 มี.ค. 2565', 'ขอขยายเวลาส่งร่างงานวิจัยฉบับสมบูรณ์', 'ด้วยข้าพเจ้า นายธีรวัฒน์  วงศ์วรัญญู อาจารย์ประจำหลักสูตรรัฐประศาสนศาสตร์  ภาควิชาสังคมศาสตร์  คณะมนุษยศาสตร์และสังคมศาสตร์  ได้รับทุนอุดหนุนการวิจัยงบประมาณปีพ.ศ. 2563  เรื่อง  “กระบวนการรับรู้นโยบายสาธารณะของประชาชนในจังหวัดเลย” งบประมาณ  40,000 (สี่หมื่นบาทถ้วน)  โดยสถาบันวิจัยและพัฒนากำหนดให้ส่ง (ร่าง)  รายงานฉบับสมบูรณ์  ภายในวันที่  20  มกราคม  2565  นั้น', 'ดังนั้น ข้าพเจ้าฯ มีความจำเป็นต้องขอขยายระยะเวลาในการส่งร่างรายงานฉบับสมบูรณ์ ตามข้างต้น  เนื่องจากเกิดความล่าช้าในการลงพื้นที่เก็บข้อมูลวิจัย  ข้าพเจ้าฯ จึงขออนุญาตขยายระยะเวลา   ในการส่งรายงานสมบูรณ์ออกไปเป็นระยะเวลา 3 เดือนทั้งนี้ตั้งแต่  วันที่  21  มกราคม  2565  ถึงวันที่   21  เมษายน  2565', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'สุนีนารถ', '11:12', 'สุนีนารถ พลซา', '15:55', 'กุสุมา', '17:15', 'นางสาวสุนีนารถ พลซา', 'เจ้าหน้าที่', '3', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:59', '��ศ.0023/64', '', '', '', 'บัวบาล', '', '11:27', '', '', '', ''),
(12, 'ภาควิชาสังคมศาสตร์', 'ผู้ปฏิบัติงานบริหาร', '4', '0012', '', '2 ม.ค. 2565', 'รักษาราชการแทน', '    ด้ายข้าพเจ้า นายวีระยุทธ สุโขยะชัย7_10มีค65', 'ในการนี้', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'นายวีระยูทธ  สุโขยะชัย', '15:09', '', '', 'กุสุมา', '15:09', 'นางวันเพ็ญ บุญทะวงศ์', 'หัวหน้าวิชาสังคมศาตร์', '', '1', '', '', 'วีระยุทธ', ' ลืมแนบเอกสาร', '15:02', '��ศ.0010/64', '', '', '', '', '', '', '', '', '', ''),
(13, 'ภาควิชาสังคมศาสตร์', 'สาขาวิชาสังคมศึกษา', '87', '0013', '', '2 มี.ค. 2565', 'ขออนุญาตเปลี่ยนแปลงวันที่ดำเนินโครงการ', 'ตามบันทึกข้อความที่ 07775 ลงวันที่ 25 ตุลาคม 2564 มหาวิทยาลัยราชภัฏเลยได้อนุมัติดำเนิน โครงการธนาคารขยะชุมชน สร้างความมั่นคงให้ครอบครัว พัฒนาชุมชนอย่างยั่งยืน” จำนวนงบประมาณทั้งสิ้น 88,480 บาท (แปดหมื่นแปดพันสี่ร้อยสี่สิบแปดบาทถ้วน) ไปแล้วนั้น เนื่องด้วยในวันที่ 28 พฤศจิกายน 2564 สำนักงานคณะกรรมการการเลือกตั้ง (กกต.) กำหนดให้มีการเลือกตั้งสมาชิกสภาองค์การบริหารส่วนตำบลและนายกองค์การบริหารส่วนตำบล (อบต.) จึงทำให้กลุ่มชาวบ้านและวิทยากรที่จะเข้าร่วมกิจกรรมในวันที่ 28 พฤศจิกายน 2564 นั้นไม่สามารถมาเข้าร่วมกิจกรรมได้ ดังนั้นจึงขอเปลี่ยนแปลงวันที่ดำเนินโครงการธนาคารขยะชุมชน สร้างความมั่นคงให้ครอบครัว พัฒนาชุมชนอย่างยั่งยืน เป็นวันที่ 1 ธันวาคม 2564  ดังรายละเอียดที่แนบมาพร้อมนี้', '', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ดร.พุทธิวัฒน์ ถาวรสินศักดิ์', '14:57', '', '', 'กุสุมา', '15:11', 'ผู้ช่วยศาสตราจารย์ ดร.พุทธิวัฒน์ ถาวรสินศักดิ์', 'อาจารย์', '', '1', '', '', 'วีระยุทธ', ' ', '15:03', '��ศ.0011/64', '', '', '', '', '', '', '', '', '', ''),
(14, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', '31', '0014', 'ภม.011/64', '2 ม.ค. 2565', 'ทดลองใช้งานระบบ E-Document ', 'ด้วยอาจารย์ประจำหลักสูตรบัณฑิตศึกษาได้ย้ายจากห้องพักอาจารย์บัณฑิตศึกษา ชั้น 1 อาคารมนุษยศาสตร์และสังคมศาสตร์ไปยังห้องพักอาคารบัณฑิตศึกษา จึงทำให้ห้องพักอาจารย์บัณฑิตศึกษา ชั้น1 อาคารคณะมนุษยศาสตร์และสังคมศาสตร์ว่างลง นั้น ', 'ทางสาขาวิชาภาษาจีนฯ จึงมีความประสงค์ขอให้อาจารย์สาขาวิชาภาษาจีนฯ เข้าพักแทน เนื่องจากประสบปัญหาเสียงรบกวนระหว่างห้องพักอาจารย์และห้องปฏิบัติการซึ่งอยู่ติดกัน โดยเฉพาะในช่วงที่มีการจัดการเรียนการสอนออนไลน์พร้อมกัน ดังนั้น เพื่อให้คณาจารย์และนักศึกษาในสาขาวิชาภาษาจีนฯ ได้จัดประชุมกลุ่มย่อยและปฏิบัติการเรียนการสอนให้เกิดประสิทธิภาพและประโยชน์สูงสุด จึงขอใช้ห้องพักอาจารย์บัณฑิตศึกษา ดังกล่าว ', 'จึงเรียนมาเพื่อโปรดพิจารณา  และขอขอบคุณมา  ณ  โอกาสนี้', 'กุลธิดา ธนกัญญา', '15:38', 'สุนีนารถ พลซา', '15:11', 'กุสุมา', '15:39', 'อาจารย์กุลธิดา ธนกัญญา', 'อาจารย์', '4', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:35', '��ศ.0015/64', '', '', '', 'บัวบาล', '', '15:43', '', '', '', ''),
(15, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาดิจิทัลอาร์ต', '50', '0015', 'ภม.010/64', '2 มี.ค. 2565', 'ขอส่งแบบโครงการพัฒนาคุณภาพผลิตภัณฑ์จักสานสู่มาตรฐานผลิตภัณฑ์ชุมชนจังหวัดเลย', '                ด้วยผู้ช่วยศาสตราจารย์ ดร.อิสริยาภรณ์ ชัยกุหลาบ ขอเสนอโครงการพัฒนาคุณภาพผลิตภัณฑ์จักสานสู่มาตรฐานผลิตภัณฑ์ชุมชนจังหวัดเลย ภายใต้โครงการแผนงานยุทธศาสตร์เสริมสร้างพลังทางสังคม : โครงการยุทธศาสตร์มหาวิทยาลัยราชภัฏเพื่อการพัฒนาท้องถิ่น มหาวิทยาลัยราชภัฏเลย ประจำปีงบประมาณ พ.ศ. 2565  พร้อมทั้งแนบเอกสารมาท้ายนี้', '', '      จึงเรียนมาเพื่อโปรดพิจารณา', 'อิสริยาภรณ์ ชัยกุหลาบ', '14:59', 'สุนีนารถ พลซา', '15:10', 'กุสุมา', '15:44', 'ผู้ช่วยศาสตราจารย์ ดร.อิสริยาภรณ์ ชัยกุหลาบ', 'อาจารย์', '4', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:35', '��ศ.0020/64', '', '', '', 'บัวบาล', '', '15:48', '', '', '', ''),
(16, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาทัศนศิลป์', '55', '0016', 'ภม.009/64', '2 มี.ค. 2565', 'ขอแก้ไขชื่อผู้ใช้งาน', 'รบกวนแก้ไขข้อมูลผู้ใช้งาน เป็น ยุพดี ผ่องศรี ภาควิชาสังคมศาสตร์ สาขาวิชา นิติศาสตร์ค่ะ \r\nขอบคุณค่ะ', '', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ยุพดี ผ่องศรี', '15:02', 'สุนีนารถ พลซา', '15:56', 'กุสุมา', '15:58', 'อาจารย์ยุพดี ชินพีระเสถียร', 'อาจารย์', '3', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:57', '��ศ.0019/64', '', '', '', '', '', '', '', '', '', ''),
(17, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', '30', '0017', 'ภม.008/64', '2 มี.ค. 2565', 'ขออนุญาตนำนักศึกษาไปนอกสถานที่', 'ด้วยด้วยสาขาวิชาภาษาจีนและอังกฤษเพื่อการสื่อสาร ภาควิชามนุษยศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์   มหาวิทยาลัยราชภัฏเลย ได้บรรจุวิชาสันทนาการและการจัดกิจกรรมค่ายภาษาอังกฤษ รหัสวิชา 1553633 ในหลักสูตรเพื่อให้ผู้เรียนได้เรียนรู้ พัฒนาทักษะภาษาอังกฤษและทักษะด้านการจัดกิจกรรมการเข้าค่ายภาษาอังกฤษ รวมทั้งเรียนรู้การแก้ปัญหาเฉพาะหน้า เพื่อเป็นการสร้างความมั่นใจในการลงมือปฏิบัติงานและการจัดกิจกรรมการเข้าค่ายในอนาคต ในการนี้ สาขาวิชาภาษาจีนและอังกฤษเพื่อการสื่อสาร ภาควิชามนุษยศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์ มีความจำเป็นจะต้องจัดทำค่ายภาษาอังกฤษในสถานที่จริงขึ้นเพื่อเป็นการทดสอบปลายภาค และทางผู้จัดทำได้พิจารณาแล้วเห็นว่า โรงเรียนบ้านนาหว้าน้อย อำเภอด่านซ้าย จังหวัดเลย เป็นโรงเรียนที่มีความเหมาะสมในการดำเนินกิจกรรมในครั้งนี้ โดยกิจกรรมดังกล่าวจะจัดขึ้นในวันที่ 22 ตุลาคม 2563 โดยกลุ่มเป้าหมายคือ นักเรียนชั้นประถมศึกษาปีที่ 3-6 โรงเรียนบ้านนาหว้าน้อยและโรงเรียนใกล้เคียงที่มีความประสงค์ในการส่งนักเรียนเข้าร่วมกิจกรรมในครั้งนี้ จำนวนทั้งสิ้น 60 คน โดยมีวัตถุประสงค์เพื่อให้นักเรียนได้เรียนรู้ภาษาในสถานการณ์จริงที่สนุกสนาน ส่งเสริมความกล้าแสดงออกในการใช้ภาษาอังกฤษและเป็นการเตรียมความพร้อมให้นักเรียนสำหรับภาคการศึกษาใหม่ เพื่อให้นักเรียนมีทักษะกระบวนการกลุ่ม มีปฏิสัมพันธ์และสร้างมิตรภาพกับผู้อื่นและสามารถนำความรู้ไปใช้ในชีวิตประจำวันได้', 'ด้วยด้วยสาขาวิชาภาษาจีนและอังกฤษเพื่อการสื่อสาร ภาควิชามนุษยศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์   มหาวิทยาลัยราชภัฏเลย ได้บรรจุวิชาสันทนาการและการจัดกิจกรรมค่ายภาษาอังกฤษ รหัสวิชา 1553633 ในหลักสูตรเพื่อให้ผู้เรียนได้เรียนรู้ พัฒนาทักษะภาษาอังกฤษและทักษะด้านการจัดกิจกรรมการเข้าค่ายภาษาอังกฤษ รวมทั้งเรียนรู้การแก้ปัญหาเฉพาะหน้า เพื่อเป็นการสร้างความมั่นใจในการลงมือปฏิบัติงานและการจัดกิจกรรมการเข้าค่ายในอนาคต ในการนี้ สาขาวิชาภาษาจีนและอังกฤษเพื่อการสื่อสาร ภาควิชามนุษยศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์ มีความจำเป็นจะต้องจัดทำค่ายภาษาอังกฤษในสถานที่จริงขึ้นเพื่อเป็นการทดสอบปลายภาค และทางผู้จัดทำได้พิจารณาแล้วเห็นว่า โรงเรียนบ้านนาหว้าน้อย อำเภอด่านซ้าย จังหวัดเลย เป็นโรงเรียนที่มีความเหมาะสมในการดำเนินกิจกรรมในครั้งนี้ โดยกิจกรรมดังกล่าวจะจัดขึ้นในวันที่ 22 ตุลาคม 2563 โดยกลุ่มเป้าหมายคือ นักเรียนชั้นประถมศึกษาปีที่ 3-6 โรงเรียนบ้านนาหว้าน้อยและโรงเรียนใกล้เคียงที่มีความประสงค์ในการส่งนักเรียนเข้าร่วมกิจกรรมในครั้งนี้ จำนวนทั้งสิ้น 60 คน โดยมีวัตถุประสงค์เพื่อให้นักเรียนได้เรียนรู้ภาษาในสถานการณ์จริงที่สนุกสนาน ส่งเสริมความกล้าแสดงออกในการใช้ภาษาอังกฤษและเป็นการเตรียมความพร้อมให้นักเรียนสำหรับภาคการศึกษาใหม่ เพื่อให้นักเรียนมีทักษะกระบวนการกลุ่ม มีปฏิสัมพันธ์และสร้างมิตรภาพกับผู้อื่นและสามารถนำความรู้ไปใช้ในชีวิตประจำวันได้', 'จึงเรียนมาเพื่อโปรดพิจารณาอนุญาต', 'อาจารย์สุรพิชญา ราชพรหมมา', '15:03', 'สุนีนารถ พลซา', '15:54', 'กุสุมา', '15:59', 'อาจารย์สุรพิชญา ราชพรหมมา', 'อาจารย์', '3', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:57', '��ศ.0022/64', '', '', '', '', '', '', '', '', '', ''),
(18, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาภาษาอังกฤษ', '19', '0018', 'ภม.007/64', '2 มี.ค. 2565', 'ขออนุญาตเปลี่ยนแปลงวันอบรม', 'ตามที่สาขาวิชาภาษาอังกฤษได้ขออนุญาตจัดโครงการอบรมภาษาอังกฤษให้กับ.....', 'เนื่องจากวิทยากรที่ให้การอบรมติดราชการด่วย ไม่สามารถให้การอบรมในวัน....ได้', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ดร. พนิดา  ตาสี', '15:04', 'สุนีนารถ พลซา', '15:10', 'กุสุมา', '15:43', 'ดร.พนิดา ตาสี', 'อาจารย์', '4', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:29', '��ศ.0017/64', '', '', '', 'บัวบาล', '', '15:44', '', '', '', ''),
(19, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาภาษาอังกฤษ', '128', '0019', 'ภม.006/64', '2 ม.ค. 2565', 'ขออนุญาตดำเนินการโครงการ', 'ด้วย สาขาวิชาภาษาอังกฤษ ภาควิชามนุษยศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์ มหาวิทยาลัยราชภัฏเลย ได้จัดทำโครงการพัฒนาคุณธรรมจริยธรรมสำหรับนักศึกษา สาขาวิชาภาษาอังกฤษ หมายเลขโครงการ ๖๔๐๐๑๓๐๖๘ โดยมีวัตถุประสงค์  เพื่อให้นักศึกษาได้มีคุณธรรมจริยธรรม ความรู้ผิดชอบชั่วดี ห่างไกลจากยาเสพติดและอบายมุขต่าง ๆ ปฏิบัติตนให้เหมาะสมระหว่างเรียน อีกทั้งเพื่อให้นักศึกษาตระหนักในบทบาทและหน้าที่ของตนเองในฐานะเป็นนักศึกษา', 'ในการนี้ สาขาวิชาภาษาอังกฤษ ภาควิชามนุษยศาสตร์ คณะมนุษยศาสตร์และสังคมศาสตร์ มหาวิทยาลัยราชภัฏเลย จึงขออนุญาตดำเนินการโครงการดังกล่าว ในวันที่ ๑๘ กันยายน ๒๕๖๔ เวลา ๐๘.๓๐ – ๑๖.๓๐ น. ผ่านระบบวิดีโอประชุมทางไกล (Video Conference) ด้วย Google Meet และขออนุมัติงบประมาณ (บ.กศ.) หมายเลขโครงการ ๖๔๐๐๑๓๐๖๘ จำนวน ๑๘,๐๐๐ บาท (หนึ่งหมื่นแปดพันบาทถ้วน) โดยมีรายละเอียดตามโครงการและกำหนดการดำเนินการโครงการที่แนบมาพร้อมนี้', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ณัฐกร หิรัญโท', '15:41', 'สุนีนารถ พลซา', '15:10', 'กุสุมา', '15:41', 'นายณัฐกร หิรัญโท', 'อาจารย์ประจำสาขาวิชาภาษาอังกฤษ', '4', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:29', '��ศ.0016/64', '', '', '', 'บัวบาล', '', '15:43', '', '', '', ''),
(20, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', '29', '0020', 'ภม.005/64', '2 ม.ค. 2565', 'ขอขยายเวลาส่ง (ร่าง) งานวิจัยฉบับสมบูรณ์', 'ด้วยข้าพเจ้า ผู้ช่วยศาสตราจารย์ ดร. ศรีจิตรา นวรัตนาภรณ์ อาจารย์ประจำสาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร คณะมนุษยศาสตร์และสังคมศาสตร์ ได้รับทุนอุดหนุนวิจัยมหาวิทยาลัยราชภัฏเลย ครั้งที่ ๓ ประจำปีงบประมาณ พ.ศ. ๒๕๖๔ เรื่อง การสร้างชุดสื่อการเรียนรู้เรื่องการพับผ้าเช็ดปากเพื่อการพัฒนาทักษะการพูดนำเสนอของนักศึกษาสาขาภาษาอังกฤษ ชั้นปีที่ ๓ มหาวิทยาลัยราชภัฏเลย  งบประมาณ ๔๐,๐๐๐ บาท (สี่หมื่นบาทถ้วน) โดยสถาบันวิจัยและพัฒนากำหนดให้ส่ง (ร่าง) รายงานฉบับสมบูรณ์ภายในวันที่ ๒๘ กุมภาพันธ์ ๒๕๖๕ นั้น ', 'ดังนั้น ข้าพเจ้าฯ มีความจำเป็นต้องขอขยายเวลาในการส่ง (ร่าง) รายงานฉบับสมบูรณ์ตามรายละเอียดข้างต้น เนื่องจากกระบวนการการสร้างสื่อมีหลายขั้นตอนซึ่งเกี่ยวข้องกับการถ่ายวิดีทัศน์การพับผ้าเช็ดปาก การอัดเสียงสองภาษา (ภาษาอังกฤษ และภาษาไทย) การถ่ายภาพนิ่งรูปแบบการพับผ้าเช็ดปาก และการนำชุดสื่อที่สร้างขึ้นไปทดลองใช้กับกลุ่มที่ไม่ใช่กลุ่มตัวอย่างจริง ซึ่งต้องใช้เวลาในการดำเนินการ อย่างไรก็ตามการวิจัยนี้ อยู่ในขั้นตอนการสรุปผลและเรียบเรียงรายงาน ข้าพเจ้าฯ จึงขอขยายระยะเวลาในการส่ง (ร่าง) รายงานวิจัยฉบับสมบูรณ์ออกไปเป็นระยะเวลา ๓ เดือน ทั้งนี้ตั้งแต่ ๒๘ กุมภาพันธ์ ๒๕๖๕ ถึงวันที่ ๓๑ พฤษภาคม ๒๕๖๕', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ศรีจิตรา นวรัตนาภรณ์', '15:35', 'สุนีนารถ พลซา', '15:09', 'กุสุมา', '15:36', 'ผู้ช่วยศาสตราจารย์ ดร.ศรีจิตรา นวรัตนาภรณ์', 'ผู้วิจัย', '4', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:29', '��ศ.0014/64', '', '', '', 'บัวบาล', '', '15:42', '', '', '', ''),
(21, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาทัศนศิลป์', '55', '0021', 'ภม.004/64', '2 มี.ค. 2565', 'test', 'test \r\n\r\nยุพดี ผ่องศรี นิติศาสตร์', '', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ยุพดี ผ่องศรี', '15:05', 'สุนีนารถ พลซา', '15:09', 'กุสุมา', '15:32', 'อาจารย์ยุพดี ชินพีระเสถียร', 'อาจารย์', '4', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:28', '��ศ.0013/64', '', '', '', 'บัวบาล', '', '15:41', '', '', '', ''),
(22, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาทัศนศิลป์', '56', '0022', 'ภม.003/64', '2 ม.ค. 2565', 'ขอส่งเล่มสรุปโครงการ ', 'ด้วยสาขาวิชาทัศนศิลป์ คณะมนุษยศาสตร์และสังคมศาสตร์ ได้รับอนุญาตให้ดำเนินโครงการ \"พัฒนาศักยภาพนักศึกษาสาขาวิชาทัศนศิลป์ด้วยกิจกรรมเสริมหลักสูตรการสร้างสรรค์ผลงานทัศนศิลป์\" หมายเลข ๖๕๐๐๑๓๐๕๕ งบประมาณ ๒๐,๖๘๐ บาท โดยมีกิจกรรมเรื่อง การปั้นดินญี่ปุ่นและปั้นหล่อเรซิ่น ในวันที่ ๑๙-๒๐ กุมภาพันธ์ ๒๕๖๕ ณ ลานกิจกรรมหน้าคณะมนุษยศาสตร์และสังคมศาสตร์ โดยมีวิทยากรจำนวน ๓ คน และนักศึกษาสาขาทัศนศิลป์ จำนวน ๒๐ คน เข้าร่วมกิจกรรมนี้', 'ในการนี้ ทางสาขาวิชาทัศนศิลป์ได้ดำเนินกิจกรรมในโครงการดังกล่าวเป็นที่เรียบร้อยแล้ว จึงมีความประสงค์ขอส่งเล่มสรุปรายงาน จำนวน ๒ เล่ม ดังเอกสารแนบ', 'จึงเรียนมาเพื่อโปรดพิจารณา', 'ดร.สิทธิวัฒน์ มีวันคำ', '15:41', 'สุนีนารถ พลซา', '15:19', 'กุสุมา', '15:59', 'อาจารย์สิทธิวัฒน์ มีคำวัน', 'อาจารย์ผู้รับผิดชอบโครงการ', '3', '', '', '', 'อารีย์ ลำมะยศ', ' ', '15:55', '��ศ.0018/64', '', '', '', 'บัวบาล', '', '15:44', '', '', '', ''),
(23, 'ภาควิชาสังคมศาสตร์', 'สาขาวิชาการพัฒนาชุมชน', '74', '0023', '', '2 มี.ค. 2565', 'ขอความอนุเคราะห์ลงนามในหนังสือเชิญวิทยากร', '             ด้วยสาขาวิชาการพัฒนาชุมชน    ภาควิชาสังคมศาสตร์    คณะมนุษยศาสตร์และสังคมศาสตร์  มหาวิทยาลัยราชภัฏเลย   จะจัดปัจฉิมนิเทศและสรุปผลงานการฝึกประสบการณ์วิชาชีพการพัฒนาชุมชนนักศึกษาชั้นปีที่ ๔   ในวันพฤหัสบดี  ๕  เมษายน  ๒๕๖๕  ระหว่าง ๐๘.๐๐ – ๑๖.๓๐ น.  ณ  หอประชุมขุมทองวิไล  เพื่อให้นักศึกษาได้มีความรู้และนำเสนอผลงานที่ได้จากการฝึกงานภาคสนามมานำเสนอในรูปแบบนิทรรศการ  โดยในภาคเช้าได้เชิญท่านพัฒนาการจังหวัดเลยเป็นวิทยากรบรรยายให้ความรู้แก่นักศึกษาสาขาวิชาดังกล่าว \r\n', '        ดังนั้น สาขาวิชาการพัฒนาชุมชน จึงขอความอนุเคราะห์ท่านคณบดีได้กรุณาลงนามในหนังสือเชิญวิทยากรตามที่แนบมาพร้อมนี้', '       จึงเรียนมาเพื่อโปรดพิจารณา', 'ผู้ช่วยศาสตราจารย์ผการัตน์ พินิจวัฒน์', '15:09', '', '', '', '', 'ผู้ช่วยศาสตราจารย์ผการัตน์ พินิจวัฒน์', 'อาจารย์ประจำสาขาวิชาการพัฒนาชุมชน', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(24, 'สำนักงานคณะ', 'เจ้าหน้าที่บริการอัดสำเนา', '14', '0024', '', '2 ม.ค. 2565', 'Test', 'Test', 'Test', 'Test', 'Test', '15:30', '', '', 'กุสุมา', '15:31', 'นายครรชิต  จันทร์อ่อน', 'Test', '4', '', '', '', '', '', '', '��ศ.0012/64', '', '', '', 'บัวบาล', '', '15:40', '', '', '', ''),
(25, 'ภาควิชามนุษยศาสตร์', 'สาขาวิชาภาษาอังกฤษธุรกิจ', '22', '0025', 'ภม.013/64', '2 ม.ค. 2565', 'ขอเปลี่ยนแปลง (ทดสอบ)', 'ด้วยข้าพเจ้า.....', 'ดังนั้น...', 'จึงเรียนมา....', 'ชมพูนุท', '15:59', 'สุนีนารถ', '15:56', 'กุสุมา', '15:58', 'ผู้ช่วยศาสตราจารย์ชมพูนุท ธีราวิทย์', 'ประธาน...', '3', '2', '', '', 'อารีย์ ลำมะยศ', ' ', '15:57', '��ศ.0021/64', '', '', '', '', '', '', '', '', '', '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `files`
--
ALTER TABLE `files`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `files_letter`
--
ALTER TABLE `files_letter`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `letters`
--
ALTER TABLE `letters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `memo`
--
ALTER TABLE `memo`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `files`
--
ALTER TABLE `files`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT for table `files_letter`
--
ALTER TABLE `files_letter`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `letters`
--
ALTER TABLE `letters`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `member`
--
ALTER TABLE `member`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=131;

--
-- AUTO_INCREMENT for table `memo`
--
ALTER TABLE `memo`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
